# CreatePullDownMenuGroupBox

## Description
Creates a Layout Manager pull down menu group box.

```pascal
PROCEDURE CreatePullDownMenuGroupBox(
				liDialogID     : LONGINT;
				liComponentID  : LONGINT;
				iPullDownWidth : INTEGER;
				strLabel       : STRING;
				bHasFrame      : BOOLEAN);
```

```python
def vs.CreatePullDownMenuGroupBox(liDialogID, liComponentID, iPullDownWidth, strLabel, bHasFrame):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|liDialogID|LONGINT|   |
|liComponentID|LONGINT|   |
|iPullDownWidth|INTEGER|   |
|strLabel|STRING|   |
|bHasFrame|BOOLEAN|   |

## Version
Availability: from VectorWorks12.5

## Category
* Dialogs - Modern